load-test-endpoints.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Prueba específica de autenticación bajo estrés
    - duration: 30
      arrivalRate: 50
      name: "Authentication stress"

    # Prueba específica de creación de órdenes
    - duration: 30
      arrivalRate: 30
      name: "Order creation stress"

    # Prueba específica de WhatsApp
    - duration: 30
      arrivalRate: 20
      name: "WhatsApp stress"

  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  # Test específico de login
  - name: "Login endpoint stress"
    weight: 100
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user{{ $randomInt(1, 10000) }}@example.com"
            password: "password123"

  # Test específico de registro
  - name: "Registration endpoint stress"
    weight: 100
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "newuser{{ $randomInt(10000, 99999) }}@example.com"
            password: "password123"
            firstName: "User{{ $randomInt(1, 1000) }}"
            lastName: "Test"
            phone: "+573001234567"

  # Test específico de productos
  - name: "Products endpoint stress"
    weight: 100
    flow:
      - get:
          url: "/api/products?limit=50&page={{ $randomInt(1, 5) }}"

  # Test específico de órdenes
  - name: "Orders endpoint stress"
    weight: 100
    flow:
      - post:
          url: "/api/orders"
          json:
            products:
              - productId: "507f1f77bcf86cd799439011"
                quantity: 1
            shippingAddress:
              street: "Test Street"
              city: "Test City"
              country: "Test Country"
              zipCode: "12345"
            paymentMethod: "paypal"

  # Test específico de WhatsApp
  - name: "WhatsApp endpoint stress"
    weight: 100
    flow:
      - post:
          url: "/api/whatsapp/send"
          json:
            to: "+573001234567"
            message: "Mensaje de estrés de carga {{ $randomInt(1, 10000) }}"